# SQL Assignment

In [64]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [65]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [66]:
conn = sqlite3.connect("Db-IMDB-Assignment.db")

#### Overview of all tables

In [67]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [68]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedyâ€™ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [69]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = """
     SELECT p.Name, m.title, m.year
        FROM Person p JOIN M_Director md ON p.PID=md.PID JOIN Movie m ON md.MID=m.MID
        WHERE m.MID IN(
            SELECT MID
            FROM M_Genre
            WHERE GID IN(
                SELECT GID
                FROM Genre
                WHERE Name LIKE '%Comedy%'
            )
        )
        AND ((CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)%4==0 AND CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)%100!=0)
        OR CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)%400==0)
        
        """

grader_1(query1)

                Name                              title  year
0       Milap Zaveri                         Mastizaade  2016
1       Danny Leiner  Harold & Kumar Go to White Castle  2004
2     Anurag Kashyap                 Gangs of Wasseypur  2012
3       Frank Coraci        Around the World in 80 Days  2004
4      Griffin Dunne             The Accidental Husband  2008
5        Anurag Basu                             Barfi!  2012
6    Gurinder Chadha                  Bride & Prejudice  2004
7         Mike Judge    Beavis and Butt-Head Do America  1996
8   Tarun Mansukhani                            Dostana  2008
9       Shakun Batra                      Kapoor & Sons  2016
Wall time: 135 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [70]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """ 
        
        SELECT Name FROM Person WHERE PID IN(
            SELECT TRIM(PID) FROM M_Cast WHERE MID IN(
                (SELECT MID FROM Movie WHERE title='Anand' and year=1971)))

         """
grader_2(query2)

                Name
0   Amitabh Bachchan
1      Rajesh Khanna
2      Sumita Sanyal
3         Ramesh Deo
4          Seema Deo
5     Asit Kumar Sen
6         Dev Kishan
7       Atam Prakash
8      Lalita Kumari
9             Savita
Wall time: 68 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [71]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" 
        SELECT p.PID
        FROM Person p 
        INNER JOIN(
            SELECT TRIM(mc.PID) PD, mc.MID FROM M_cast mc
            WHERE mc.MID IN (
                        SELECT mv.MID FROM Movie mv
                        WHERE CAST(SUBSTR(mv.year,-4) AS Integer)<1970
                        )
        ) r1
        ON r1.PD=p.PID 
        
        """
query_more_1990 =""" 
        SELECT p.PID
        FROM Person p 
        INNER JOIN(
                SELECT TRIM(mc.PID) PD, mc.MID FROM M_cast mc
                WHERE mc.MID IN(
                            SELECT mv.MID FROM Movie mv
                            WHERE CAST(SUBSTR(mv.year,-4) AS Integer)>1990
                            )
        ) r1 
        on r1.PD=p.PID
        
        """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

(4942, 1)
(62570, 1)
True
Wall time: 564 ms

In [72]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    assert (q3_results.shape == (300,1))

query3 = """ 
        
       SELECT Name
       FROM(
           SELECT Name, PID
           FROM Person
           WHERE PID IN(
                SELECT TRIM(PID) FROM M_Cast
                WHERE MID IN (
                    SELECT MID
                    FROM Movie
                    WHERE CAST(SUBSTR(year,-4) AS Integer)<1970
                    )
           )
           
           INTERSECT
           
           SELECT Name, PID
           FROM Person
           WHERE PID IN(
                SELECT TRIM(PID)
                FROM M_Cast
                WHERE MID IN (
                    SELECT MID
                    FROM Movie
                    WHERE CAST(SUBSTR(year,-4) AS Integer)>1990
                    )
           )
        )
           
        
         """
grader_3(query3)

                 Name
0         A.K. Hangal
1      Aachi Manorama
2               Abbas
3               Abdul
4   Abhi Bhattacharya
5      Achala Sachdev
6                Ajay
7                Ajit
8        Akbar Bakshi
9                Alka
Wall time: 407 ms

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [11]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10), query_4a.shape) 
    return (query_4a.shape == (1462,2))

# *** Write a query, which will return all the directors(id's) along with the number of movies they directed ***
query_4a =""" 
        SELECT md.PID AS Directors_ID, COUNT(m.MID) AS Movies_Count
        FROM M_Director md JOIN Movie m ON m.MID=md.MID
        GROUP BY md.PID

          """
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

  Directors_ID  Movies_Count
0    nm0000180             1
1    nm0000187             1
2    nm0000229             1
3    nm0000269             1
4    nm0000386             1
5    nm0000487             2
6    nm0000965             1
7    nm0001060             1
8    nm0001162             1
9    nm0001241             1 (1462, 2)
True
Wall time: 24 ms

In [83]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.shape)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))
# *** Write your query for the question 4 ***
query4 = """ 
            
        SELECT *
        FROM(
            SELECT p.Name, COUNT(m.MID) AS Movies_Count
            FROM M_Director md JOIN Movie m ON m.MID=md.MID JOIN Person p ON p.PID=md.PID
            GROUP BY md.PID
            )
        WHERE Movies_Count>=10
        ORDER BY Movies_Count DESC

        """
grader_4(query4)

(58, 2)
                    Name  Movies_Count
0           David Dhawan            39
1           Mahesh Bhatt            35
2           Priyadarshan            30
3        Ram Gopal Varma            30
4           Vikram Bhatt            29
5   Hrishikesh Mukherjee            27
6            Yash Chopra            21
7        Basu Chatterjee            19
8         Shakti Samanta            19
9           Subhash Ghai            18
Wall time: 154 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [12]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))
# *** Write your query that will get movie id, and number of people for each geneder ***
query_5aa =""" 
            SELECT m.MID, p.Gender, COUNT(p.Name) AS Count
            FROM Movie m JOIN M_Cast mc ON m.MID=mc.MID JOIN Person p ON p.PID=TRIM(mc.PID)
            GROUP BY m.MID, P.Gender

           """

print(grader_5aa(query_5aa))

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))
# *** Write your query that will have at least one male actor try to use query that you have written above ***
query_5ab =""" 
            SELECT m.MID, p.Gender, COUNT(p.Name) AS Count
            FROM Movie m JOIN M_Cast mc ON m.MID=mc.MID JOIN Person p ON p.PID=TRIM(mc.PID)
            GROUP BY m.MID, P.Gender
            HAVING P.Gender='Male' AND Count>=1

           """

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

         MID  Gender  Count
0  tt0021594    None      1
1  tt0021594  Female      3
2  tt0021594    Male      5
3  tt0026274    None      2
4  tt0026274  Female     11
5  tt0026274    Male      9
6  tt0027256    None      2
7  tt0027256  Female      5
8  tt0027256    Male      8
9  tt0028217  Female      3
True
         MID Gender  Count
0  tt0021594   Male      5
1  tt0026274   Male      9
2  tt0027256   Male      8
3  tt0028217   Male      7
4  tt0031580   Male     27
5  tt0033616   Male     46
6  tt0036077   Male     11
7  tt0038491   Male      7
8  tt0039654   Male      6
9  tt0040067   Male     10
True
Wall time: 1.47 s

In [13]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))

query5a = """ 
            SELECT SUBSTR(TRIM(year), -4) AS YEAR, COUNT(MID) AS Female_Cast_Only_Movies
            FROM(
                SELECT m.year, m.MID
                FROM Movie m JOIN M_Cast mc ON m.MID=mc.MID JOIN Person p ON p.PID=TRIM(mc.PID)
                GROUP BY m.MID, P.Gender
                HAVING m.MID NOT IN(            
                            SELECT MID FROM(
                                    SELECT m.MID, p.Gender, COUNT(p.Name) AS Count
                                    FROM Movie m JOIN M_Cast mc ON m.MID=mc.MID JOIN Person p ON p.PID=TRIM(mc.PID)
                                    GROUP BY m.MID, P.Gender
                                    HAVING P.Gender='Male' AND Count>=1
                            )
                )
            )
            GROUP BY year

          """
grader_5a(query5a)

   YEAR  Female_Cast_Only_Movies
0  1939                        1
1  1999                        1
2  2000                        1
3  2018                        1
Wall time: 1.29 s

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [14]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """ 

            SELECT t1.YEAR, (t1.Female_Cast_Only_Movies*100.0/t2.Total_Movies) AS Percentage_Female_Only_Movie, t2.Total_Movies
            FROM
            (SELECT SUBSTR(TRIM(year), -4) AS YEAR, COUNT(MID) AS Female_Cast_Only_Movies
            FROM(
                SELECT m.year, m.MID
                FROM Movie m JOIN M_Cast mc ON m.MID=mc.MID JOIN Person p ON p.PID=TRIM(mc.PID)
                GROUP BY m.MID, P.Gender
                HAVING m.MID NOT IN(            
                            SELECT MID FROM(
                                    SELECT m.MID, p.Gender, COUNT(p.Name) AS Count
                                    FROM Movie m JOIN M_Cast mc ON m.MID=mc.MID JOIN Person p ON p.PID=TRIM(mc.PID)
                                    GROUP BY m.MID, P.Gender
                                    HAVING P.Gender='Male' AND Count>=1
                            )
                )
            )
            GROUP BY year) t1
            JOIN
            (SELECT SUBSTR(TRIM(year), -4) AS year, COUNT(MID) AS Total_Movies
            FROM Movie
            GROUP BY SUBSTR(TRIM(year), -4)) t2
            
            ON t1.YEAR=t2.year
            
          """
grader_5b(query5b)

   YEAR  Percentage_Female_Only_Movie  Total_Movies
0  1939                     50.000000             2
1  1999                      1.515152            66
2  2000                      1.562500            64
3  2018                      0.961538           104
Wall time: 1.36 s

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [15]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.shape)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """
            SELECT m.title, COUNT(DISTINCT mc.PID) AS cast_size
            FROM Movie m JOIN M_Cast mc ON m.MID=mc.MID
            GROUP BY m.MID
            ORDER BY cast_size DESC

         """
grader_6(query6)

(3473, 2)
                        title  cast_size
0               Ocean's Eight        238
1                    Apaharan        233
2                        Gold        215
3             My Name Is Khan        213
4  Captain America: Civil War        191
5                    Geostorm        170
6                     Striker        165
7                        2012        154
8                      Pixels        144
9       Yamla Pagla Deewana 2        140
Wall time: 482 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [16]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 2))
    
query7a = """ 
            SELECT year , COUNT(title) AS Total_Movies
            FROM Movie
            GROUP BY CAST(SUBSTR(year, -4) AS INTEGER)

          """
grader_7a(query7a)

# using the above query, you can write the answer to the given question

   year  Total_Movies
0  1931             1
1  1936             3
2  1939             2
3  1941             1
4  1943             1
5  1946             2
6  1947             2
7  1948             3
8  1949             3
9  1950             2
Wall time: 10 ms

In [84]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10), q7b_results.shape)
    assert (q7b_results.shape == (713, 4))
    
query7b = """   

            SELECT t1.year, t1.Total_Movies, t2.year, t2.Total_Movies
            FROM
                (SELECT year , COUNT(title) AS Total_Movies
                FROM Movie
                GROUP BY CAST(SUBSTR(year, -4) AS INTEGER)) AS t1

                JOIN

                (SELECT year , COUNT(title) AS Total_Movies
                FROM Movie
                GROUP BY CAST(SUBSTR(year, -4) AS INTEGER)) AS t2

                ON CAST(SUBSTR(t1.year, -4) AS INTEGER) <= CAST(SUBSTR(t2.year, -4) AS INTEGER)
                AND CAST(SUBSTR(t1.year, -4) AS INTEGER)+9 >= CAST(SUBSTR(t2.year, -4) AS INTEGER)
    
          """
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

   year  Total_Movies  year  Total_Movies
0  1931             1  1931             1
1  1931             1  1936             3
2  1931             1  1939             2
3  1936             3  1936             3
4  1936             3  1939             2
5  1936             3  1941             1
6  1936             3  1943             1
7  1939             2  1939             2
8  1939             2  1941             1
9  1939             2  1943             1 (713, 4)
Wall time: 29.8 ms

In [18]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))
""" *** Write a query that will return the decade that has maximum number of movies ***"""
query7 = """
            
            SELECT year1, SUM(Total_Movies2) AS Decade_Movie_Count
            FROM(
                SELECT t1.year1, t1.Total_Movies AS Total_Movies1, t2.year2, t2.Total_Movies AS Total_Movies2
                FROM
                (SELECT year AS year1 , COUNT(title) AS Total_Movies
                FROM Movie
                GROUP BY CAST(SUBSTR(year1, -4) AS INTEGER)) AS t1

                JOIN

                (SELECT year AS year2 , COUNT(title) AS Total_Movies
                FROM Movie
                GROUP BY CAST(SUBSTR(year2, -4) AS INTEGER)) AS t2

                ON CAST(SUBSTR(t1.year1, -4) AS INTEGER) <= CAST(SUBSTR(t2.year2, -4) AS INTEGER)
                AND CAST(SUBSTR(t1.year1, -4) AS INTEGER)+9 >= CAST(SUBSTR(t2.year2, -4) AS INTEGER)
            )
            GROUP BY year1
            ORDER BY Decade_Movie_Count DESC
            LIMIT 1

         """
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

  year1  Decade_Movie_Count
0  2008                1203
Wall time: 23 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [34]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.shape)
    print(q8a_results.head(10))
    assert (q8a_results.shape == (73408, 3))
# *** Write a query that will results in number of movies actor-director worked together ***
query8a = """
        
            SELECT TRIM(mc.PID) AS Actor, md.PID AS Director, COUNT(md.MID) AS Movies_Count
            FROM M_Director md JOIN M_Cast mc ON md.MID=mc.MID
            GROUP BY Actor, Director
            order by actor desc
         
          """
grader_8a(query8a)

# using the above query, you can write the answer to the given question

(73408, 3)
       Actor   Director  Movies_Count
0  nm9990705  nm4264671             1
1  nm9990704  nm4264671             1
2  nm9990703  nm4264671             1
3  nm9988018  nm1464314             1
4  nm9988016  nm1464314             1
5  nm9985086  nm0151511             1
6  nm9984770  nm1150656             1
7  nm9984769  nm1150656             1
8  nm9984768  nm1150656             1
9  nm9984767  nm1150656             1
Wall time: 805 ms

In [63]:
%%time
# yesh chopra PID = nm0007181
def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.shape)
    print(q8_results.head(10))
    assert (q8_results.shape == (245, 2))
# *** Find all the actors that made more movies with Yash Chopra than any other director ***
query8 = """
        
      SELECT Name, Movies_Count
      FROM (
        SELECT *,
        Rank () OVER(
        PARTITION BY Actor
        ORDER BY Movies_Count DESC
        ) AS a
        FROM(
            SELECT p.Name, TRIM(mc.PID) AS Actor, md.PID AS Director, COUNT(md.MID) AS Movies_Count
            FROM M_Director md JOIN M_Cast mc ON md.MID=mc.MID JOIN Person p ON p.PID=TRIM(mc.PID)
            GROUP BY Actor, Director
            )
        )
    WHERE a=1 AND Director IN(SELECT PID FROM Person WHERE Name LIKE '%Yash chopra%')
    ORDER BY Movies_Count DESC

        """
grader_8(query8)

(245, 2)
                Name  Movies_Count
0        Jagdish Raj            11
1   Manmohan Krishna            10
2           Iftekhar             9
3      Shashi Kapoor             7
4      Rakhee Gulzar             5
5     Waheeda Rehman             5
6           Ravikant             4
7     Achala Sachdev             4
8        Neetu Singh             4
9      Leela Chitnis             3
Wall time: 1.24 s

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [49]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))
# *** Write a query that answers the 9th question ***
query9a = """
            /*S1*/
            SELECT DISTINCT PID FROM M_Cast
            WHERE MID IN(
                    select MID FROM M_Cast  /*all the movie in which shah rukh khan acted*/
                    WHERE TRIM(PID) IN(SELECT PID FROM Person WHERE Name LIKE '%Shah Rukh Khan%')
            ) AND TRIM(PID) NOT IN(SELECT PID FROM Person WHERE Name LIKE '%Shah Rukh Khan%')


          """
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

          PID
0   nm0004418
1   nm1995953
2   nm2778261
3   nm0631373
4   nm0241935
5   nm0792116
6   nm1300111
7   nm0196375
8   nm1464837
9   nm2868019
(2382, 1)
Wall time: 149 ms

In [85]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """
            /*s2*/
            SELECT DISTINCT PID from M_Cast
            WHERE MID IN(
                        SELECT DISTINCT MID FROM M_Cast
                        WHERE PID IN(
                                    SELECT PID FROM M_Cast
                                    WHERE MID IN(
                                            SELECT MID FROM M_Cast
                                            WHERE TRIM(PID) IN(SELECT PID FROM Person WHERE Name LIKE '%Shah Rukh Khan%')
                                    ) AND TRIM(PID) NOT IN(SELECT PID FROM Person WHERE Name LIKE '%Shah Rukh Khan%')
                        )
            ) AND PID NOT IN(
                            SELECT DISTINCT PID FROM M_Cast
                            WHERE MID IN(
                                    SELECT MID FROM M_Cast
                                    WHERE TRIM(PID) IN(SELECT PID FROM Person WHERE Name LIKE '%Shah Rukh Khan%')
                            )
            )


         """
grader_9(query9)

          PID
0   nm2539953
1   nm0922035
2   nm0324658
3   nm0943079
4   nm0000218
5   nm0001394
6   nm0929654
7   nm3116102
8   nm3248891
9   nm2418809
(25698, 1)
Wall time: 669 ms